Tekla Open API Reference for Tekla Structures 2025
Filter Properties
The Filter type exposes the following members.
Properties
Name | Description
FilterExpression
 Gets the current FilterExpression instance.
Top
See Also
Reference
Filter Class
Tekla.Structures.Filtering Namespace